/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */

"btn_pay" = "دفع";
"btn_submit" = "قبول";
"btn_next" = "التالي";
"btn_skip" = "تجاوز";

"btn_send_sms" = "أرسل SMS";
"btn_resend_sms" = "إعادة الإرسال بعد \n%d ثانية";

/* 界面 - JP 收银台 */
"navbar_checkout_title" = "الدفع";
"btn_checkout_agreement" = "أوافق على اتفاقية JollyPay واحفظ هذه البطاقة لاستخدامها في المستقبل";
"btn_checkout_agreement_highlight" = "اتفاقية JollyPay";

"label_checkout_completion_time" = "إتمام عملية الدفع في";

"cell_label_checkout_default_tips" = "ادفع باستخدام بطاقة الخصم أو بطاقة الائتمان";
"cell_label_checkout_default_change" = "تغيير";
"cell_label_checkout_discount" = "خصم";

"cell_label_paymethod_balance" = "رصيد حساب";
"cell_label_paymethod_balance_left" = "متبقى";
"cell_label_paymethod_balance_invalid" = "تجاوز مبلغ الطلب الرصيد المتاح";

/* 界面 - 收银台加载异常 */
"label_loadingerror_inited_title" = "فشلت التهيئة";
"label_loadingerror_inited_detail" = "يرجى التحقق من اتصالك بالشبكة";
"btn_loadingerror_inited_operation" = "حاول مرة أخرى";

"label_loadingerror_network_title" = "عفواً";
"label_loadingerror_network_detail" = "يرجى التحقق من اتصالك بالشبكة.";
"btn_loadingerror_network_operation" = "حاول مرة أخرى";

"label_loadingerror_unusual_detail" = "عذراًً،  ولكن تم قفل حسابك بسبب أعمال غير صحيحة. يرجى المحاولة بطريقة دفع أخرى.";
"btn_loadingerror_unusual_operation" = "رجوع";

/* 界面 - 银行卡组件 */
"placeholder_bankpayment_card_number" = "رقم البطاقة";
"placeholder_bankpayment_mmyy" = "الشهر/السنة";
"placeholder_bankpayment_cvvcode" = "كود CVV";
"placeholder_bankpayment_card_holder_name" = "الاسم على البطاقة (اختياري)";

/* 界面 - 银行卡支付 */
"label_bankpayment_mada" = "هذه البطاقة هي بطاقة مدى.";

/* 界面 - 银行卡验证 */
"label_validcard_header_title" = "قم بتحديث معلومات بطاقتك";
"label_validcard_header_description" = "يجب تحديث خيار الدفع في حسابك الذي تم استخدمه %@ المنتهية برقم %@ لاستكمال العملية";
"btn_validcard_delete" = "نسيت أو فقدت؟ حذف هذه البطاقة";
"btn_validcard_delete_highlight" = "حذف هذه البطاقة";
"tips_validcard_delete" = "إذا كنت ترغب في حذف %@ %@ ، انقر للتأكيد.";

/* 界面 - SADAD 支付 */
"placeholder_sadad_account" = "أدخل الاسم المستعار  للدفع عبر الانترنت";
"btn_sadad_change" = "تريد تغييره؟";
"label_sadad_description" = "يرجى الملاحظة:\n1. يمكنك استخدام سداد مع جميع البنوك السعودية تقريبًا.\n2.يختلف دفع سداد عبر الإنترنت عن السداد العادي. مع هذه الطريقة لا تحتاج إلى 'Biller Code'.\n\nلا تملك حساب سداد؟\nلا مشكلة ، يرجى اتباع هذه الخطوات وإكمال الدفع الخاص بك.\n\n1. تسجيل الدخول إلى حسابك البنكي والاشتراك في خدمة سداد.\n2. أدخل اسم المستخدم الخاص بـ SADAD الذي تم إنشاؤه مسبقًا مع حسابك المصرفي.\n3. أدخل كلمة المرور المسجلة الخاصة بك.\n4. أدخل كلمة المرور لمرة واحدة (OTP) التي تم إرسالها عبر الSMS.\n5. تأكيد واستكمال الدفع";
"lable_sadad_title" = "مبلغ الدفع";

/* 界面 - 绑定手机 */
"label_bindphone_title" = "ربط رقم الجوال";
"label_bindphone_description" = "للحفاظ على أمان حسابك ، يرجى ربط رقم الجوال أولاً.";
"label_bindphone_region_title" = "المنطقة";
"label_bindphone_region_value" = "Saudi Arabia";
"label_bindphone_note" = "ملاحظة: سيتم إرسال رمز التحقق إلى الجوال عند إجراء الدفع باستخدام البطاقة البنكية في حسابك. يرجى التأكد من رقم الجوال.";

/* 界面 - 选择手机国家码 */
"label_selectcountry_title" = "من فضلك اختر";

/* 界面 - 验证手机号 */
"label_validphone_title" = "التحقق من الرسائل القصيرة SMS";
"label_validphone_description" = "تم إرسال رمز التحقق إلى : ";
"placeholder_validphone_smscode" = "رمز التحقق";
"placeHolder_validphone_number" = "رقم الجوال";

/* 界面 - 支付密码设置 */
"label_setpassword_title" = "تعيين كلمة مرور الدفع";
"label_setpassword_description" = "ستكون كلمة مرور الدفع مطلوبة في كل مرة تقوم فيها بالدفععن طريق بطاقات البنك في حسابك.\nيرجى وضعها بعناية وحفظها.";
"label_resetpassword_title" = "إعادة تعيين كلمة مرور الدفع";
"label_comfirmpassword_title" = "تأكيد كلمة مرور الدفع";
"label_setpassword_payment_title" = "ضبط كلمة المرور";
"label_couponinfo_description_1" = "سيتم استخدام الخصم";
"label_couponinfo_description_2" = "لهذه التحويل";

/* 界面 - 快捷支付 */
"label_quickpayment_inputpwd_title" = "أدخل كلمة مرور الدفع";
"btn_quickpayment_inputpwd_forgot" = "هل نسيت كلمة المرور؟";
"label_quickpayment_inputsms_title" = "التحقق من الرسائل القصيرة SMS";
"label_quickpayment_inputsms_description" = "تتطلب العملية تأكيد SMS. تم إرسال رمز التحقق إلى الجوال: ";

/* 界面 - 支付结果 */
"label_result_success_title" = "تم بنجاح";
"label_result_success_detail" = "تم الدفع بنجاح";

"label_result_pending_title" = "قيد الانتظار/جاري المعالجة";
"label_result_pending_detail" = "الدفع في انتظار المعالجة. الدفع قيد التنفيذ..";

"label_result_error_title" = "خطأ";
"label_result_error_detail" = "لا يمكن إتمام هذه العملية بسبب عدم كفاية الرصيد.";

"label_result_oops_title" = "عفواً";
"label_result_oops_detail" = "يرجى التحقق من اتصالك بالشبكة.";

/* 界面 - 用户协议 */
"navbar_agreement_title" = "اتفاقية";

/* 界面 - 3DS 支付 */
"navbar_3ds_title" = "التحقق الآمن ثلاثي الأبعاد";

/* 界面 - 银行卡支付中绑卡 */
"label_payment_bindcard_note" = "لحفظ هذه البطاقة ، يجب عليك إثبات ملكية الجوال لوضع كلمة مرور الدفع";

/* 提示信息 */
"tips_action_ok" = "OK";
"tips_action_cancel" = "إلغاء";
"tips_action_goto_setup" = "اذهب الى للتثبيت";
"tips_action_verify_sms" = "تحقق من خلال رمز الرسائل القصيرة";
"tips_action_retry" = "حاول مرة أخرى";
"tips_action_confirm" = "تأكيد";
"tips_action_enable" = "ممكن";
"tips_action_enter_pwd" = "أدخل كلمة المرور";

"tips_operation_success" = "تم بنجاح";
"tips_operation_processing" = "جاري المعالجة";

"tips_network_timeout" = "نفذ الوقت بسبب خطأ في النظام";
"tips_response_order_expired" = "عذرًا ، انتهت صلاحية الطلب.";
"tips_response_error" =  "خطأ غير معروف. غير ممكن معرفة سبب المشكلة بشكل واضح. حاول مرة اخرى";

"tips_checkout_setpwd" = "يرجى إعداد كلمة مرور الدفع قبل الدفع";

"tips_title_invalid_pwd" = "كلمة المرور غير صحيحة";
"tips_quickpaymentcode_invalid_twice" = "كلمة المرور غير صحيحة. يمكنك إعادة المحاولة  أو استخدام رمز التحقق";
"tips_quickpaymentcode_invalid_once" = "كلمة المرور غير صحيحة. يمكنك المحاولة مرة أخرى.";

"tips_sadad_invalid_account" = "يجب أن تحتوي حروف الاسم المستعار لحساب سداد على حروف أبجدية";
"tips_sadad_length_account" = "يجب أن يكون الاسم المستعار لمعرف حساب سداد بحد أدنى 6 أحرف والحد الأقصى 12 حرفًا";

/* 手机号校验 */
"tips_phone_invalid_length" = "يجب أن يكون رقم هاتفك المحمول %@ رقمًا طويلاً";
"tips_phone_invalid_prefix" = "يجب أن يبدأ رقم هاتفك المحمول بـ %@";
"tips_phone_invalid" = "يرجى إدخال رقم هاتف محمول صحيح";

"tips_verification_sended" = "تم إرسال رمز التحقق إلى الجوال.";
"tips_verification_invalid" = "يرجى إدخال رمز التحقق صالح";

"tips_password_warning_weak" = "كلمة المرور ضعيفة جدًا ، الرجاء إعادة إدخالها.";
"tips_password_error_match" = "عدم تتطابق كلمات المرور. يرجى إعادة الإدخال.";

"tips_payment_bankcard_notsupported" = "عذرًا ، لا يمكننا دعم هذه البطاقة";
"tips_currency_charged_description" = "سيتم فرض رسوم على حسابك %@";

"tips_payment_timeout" = "انتهت المهلة المحددة";

/* 生物验证 */
"tips_authid_enable_title" = "JollyPay السماح بدفع باللمس / الوجه  لـ ";
"tips_authid_allow_description" = "يرجى التحقق من %@";
"tips_authid_face" = "معرف الوجه";
"tips_authid_touch" = "معرف اللمس";
"tips_authid_locked" = "فتح هاتفك المحمول";

/* 退出收银台 */
"tips_checkout_exit" = "الدفع غير مكتمل ، تابع للخروج؟";

/* Session 失效 */
"response_msg_session_expired" = "عذرا، انتهت صلاحية الدورة.";
/* 营销系统 - 红包无效 */
"response_msg_coupon_invalid" = "عذرًا ، لا يمكن استخدام الكوبون ، يرجى المحاولة مرة أخرى.";
/* 手机号 - 已被使用 */
"response_msg_phone_bind_used" = "تم استخدام الهاتف المحمول ، يرجى استخدام رقم هاتف محمول مختلف.";
/* 验证码 - 发送失败 */
"response_msg_phone_sms_send_failure" = "فشل في إرسال التحقق. حاول مرة اخرى.";
/* 验证码 - 手机号被锁 */
"response_msg_phone_sms_locked" = "عذرا ، لقد فشلت %@ مرات. سيتم قفل العملية لمدة %@ دقيقة.";
/* 支付 - 转汇查询超时 */
"response_msg_currency_timeout" = "فشل في الاستعلام عن سعر الصرف. اضغط للاستعلام مرة أخرى.";
/* 支付 - 币种不支持 */
"response_msg_currency_not_supported" = "عذرًا ، لا يمكننا دعم العملة";
/* 支付 - 预路由失败 */
"response_msg_payment_preouting_error" = "غير قادر على توجيه الصفقة. حاول مرة اخرى.";
/* 支付 - 风控拦截 */
"response_msg_payment_intercepted" = "لم تتم المعاملة بسبب أن الطلب في خطر كبير";
/* 支付 - 支付账号被锁 */
"response_msg_payment_account_locked" = "عذرا ، لقد فشلت عدة مرات. سيتم قفل حسابك لمدة %@ دقائق.";
/* 银行卡 - 绑卡超出范围 */
"response_msg_bankcard_bind_outrnage" = "عذرًا ، يمكنك فقط إضافة @% بطاقات إلى حسابك.";
/* 银行卡 - 绑卡失败 */
"response_msg_bankcard_bind_failure" = "فشل في إضافة بطاقة البنك";
/* 银行卡 - 重复绑卡 */
"response_msg_bankcard_bind_again" = "تمت إضافة بطاقة البنك. يرجى عدم إضافتها مرة أخرى.";
/* 银行卡 - 更新失败 */
"response_msg_bankcard_update_failure" = "فشل في تحديث معلومات البنك.";
/* 银行卡 - 删除失败 */
"response_msg_bankcard_remove_failure" = "فشل في حذف بطاقة البنك، يرجى المحاولة مرة أخرى";

// 原始
"payment_method_sadad" = "Sadad";
"payment_method_mada" = "Mada";
